Revit 2027 API
AnalyticalTransferSwitchData Properties
The AnalyticalTransferSwitchData type exposes the following members.
Properties
Name | Description
AssignedPhasesNumber |  The number of electrical phases assigned through the distribution system of the power distributable node.
(Inherited from AnalyticalPowerDistributableNodeData)
AssignedVoltage |  The voltage assigned through the distribution system of the power distributable node.
(Inherited from AnalyticalPowerDistributableNodeData)
ConnectedPhases |  The electrical connected phases of the electrical analytical node to its upstream node.
(Inherited from AnalyticalDistributionNodePropertyData)
CurrentRating |  The current rating value of the electrical analytical transfer switch.
DistributionSystem |  The distribution system of the power distributable node.
(Inherited from AnalyticalPowerDistributableNodeData)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from AnalyticalDistributionNodePropertyData)
TotalConnectedCurrent |  The total connected current of the electrical analytical transfer switch.
Top
See Also
Reference
AnalyticalTransferSwitchData Class
Autodesk.Revit.DB.Electrical Namespace